help_text = """
```
기재되어 있는 회사 명 · 제품명 · 시스템 이름은 해당 소유자의 상표 또는 등록 상표입니다.
(C) 2004 - 2025 ©NEXON Corp.All Rights Reserved.
(C) 2010 - 2025 SQUARE ENIX CO., LTD. All Rights Reserved. Published in Korea by ACTOZ SOFT CO., LTD.

날씨 계산 로직: EorzeaEnv 사용
```

**!주사위**
1~100 사이의 정수를 랜덤하게 뿌려줍니다.
10 이하일 경우 footer에 특별한 문구가 추가됩니다.

**메이플**
메이플스토리 캐릭터명 입력 시 해당 캐릭터의 기본 정보 (캐릭터명, 월드, 레벨, 직업, 길드명, 캐릭터 생성일)를 조회할 수 있습니다.

**행보관**
퍼스트 디센던트의 ETA-0 교환 목록을 조회할 수 있습니다. (교환소 운영 기간에만 조회 가능)

**파판날씨**
각 지역/확장팩별 현재 에오르제아 시간, 날씨와 다음 날씨 예보를 조회할 수 있습니다.
"""