weather_dict = {
    "라노시아": ["림사 로민사", "중부 라노시아", "저지 라노시아", "동부 라노시아", "서부 라노시아", "고지 라노시아", "외지 라노시아", "늑대우리 부두"],
    "검은장막 숲": ["그리다니아", "검은장막 숲 중부삼림", "검은장막 숲 동부삼림", "검은장막 숲 남부삼림", "검은장막 숲 북부삼림"],
    "다날란": ["울다하", "서부 다날란", "중부 다날란", "동부 다날란", "남부 다날란", "북부 다날란"],
    "창천": ["이슈가르드", "커르다스 중앙고지", "커르다스 서부고지", "아발라시아 구름바다", "아지스 라", "이딜샤이어", "고지 드라바니아", "저지 드라바니아", "드라바니아 구름바다"],
    "홍련": ["랄거의 손길", "기라바니아 변방지대", "기라바니아 산악지대", "기라바니아 호반지대", "쿠가네", "홍옥해", "얀샤", "아짐 대초원"],
    "칠흑": ["크리스타리움", "율모어", "레이크랜드", "콜루시아 섬", "아므 아랭", "일 메그", "라케티카 대삼림", "템페스트"],
    "효월": ["라자한", "사베네어 섬", "갈레말드", "올드 샬레이안", "라비린토스", "비탄의 바다", "울티마 툴레", "엘피스"],
    "황금": ["툴라이욜라", "오르코 파차", "코자말루 카", "야크텔 밀림", "솔루션 나인", "샬로니 황야", "헤리티지 파운드", "리빙 메모리"],
    "하우징/기타": ["모르도나", "안갯빛 마을", "라벤더 안식처", "하늘잔 마루", "지고천 거리", "시로가네", "무인도(이름 없는 섬)"]
}